path = "C:/Users/SemenS/PycharmProjects/Тимп/22.csv"

regex_patterns = {
    "telephone": r"^\+7-\(9\d{2}\)-\d{3}-\d{2}-\d{2}$",  # +7-(999)-123-45-67
    "http_status_message": r"^[A-Za-z\s]+$",  # 200 OK, 404 Not Found
    "inn": r"^\d{12}$",
    "identifier": r"^\d{2}-\d{2}/\d{2}$",  # 56-93/89
    "ip_v4": r"^\d{1,3}\.\d{1,3}\.\d{1,3}\.\d{1,3}$",  # 163.41.246.89
    "latitude": r"^-?\d{1,2}(\.\d+)?$",  # -84.731565 или 34.308002
    "blood_type": r"^(A|B|AB|O)[+\−]$",  # B+, AB− и т.д.
    "isbn": r"^(?:\d{1,3}-)?\d-\d{5}-\d{3}-\d$",  # 1-80275-634-7 или 097-1-34126-295-6
    "uuid": r"^[0-9a-f]{8}-[0-9a-f]{4}-[0-9a-f]{4}-[0-9a-f]{4}-[0-9a-f]{12}$",
    "date": r"^\d{4}-\d{2}-\d{2}$",  # 2018-04-21
}